tap "yqrashawn/goku"

# Binaries
brew "bat"
brew "coreutils"
brew "git-delta"
brew "espanso"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "jq"
brew "lazygit"
brew "mas"
brew "mise"
brew "ripgrep"
brew "starship"
brew "stow"
brew "yqrashawn/goku/goku", restart_service: true
brew "yt-dlp"
brew "zoxide"

# Apps
cask "1password"
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "betterdisplay"
cask "ears"
cask "ghostty"
cask "hammerspoon"
cask "hazel"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "localsend"
cask "maestral"
cask "rectangle-pro"
cask "swiftbar"
cask "ungoogled-chromium"
cask "vscodium"
cask "xld"
cask "zed@preview"
