# TIP: To maintain these organized sections, manually add new packages or generate a
# dump to a temporary file (`brew bundle dump --file=/tmp/Brewfile`) and copy over what you need.
# To see what you currently have installed, use:
#   - `brew tap` (taps)
#   - `brew leaves` (binaries/formulae)
#   - `brew list --cask` (apps)
#   - `mas list` (Mac App Store apps)

tap "felixkratz/formulae"
tap "yqrashawn/goku"

# Binaries
brew "bat"
brew "borders"
brew "coreutils"
brew "git-delta"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "jq"
brew "lazygit"
brew "markdownlint-cli"
brew "mas"
brew "mise"
brew "monolith"
brew "ripgrep"
brew "sketchybar"
brew "starship"
brew "stow"
brew "yqrashawn/goku/goku", restart_service: true
brew "yt-dlp"
brew "zoxide"

# Apps
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "alfred"
cask "appcleaner"
cask "betterdisplay"
cask "ears"
cask "espanso"
cask "ghostty"
cask "hammerspoon"
cask "hazel"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "localsend"
cask "maestral"
cask "ungoogled-chromium"
cask "vscodium"
cask "xld"
cask "zed@preview"

# Mac App Store
mas "CotEditor", id: 1024640650
mas "Dropover", id: 1355679052
mas "Fantastical", id: 975937182
mas "Find Any File", id: 402569179
mas "Folder Peek", id: 1615988943
mas "GrandPerspective", id: 1111570163
mas "Name Mangler 3", id: 603637384
mas "Peek", id: 1554235898
mas "Refined GitHub", id: 1519867270
mas "StopTheMadness Pro", id: 6471380298
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
mas "Tot", id: 1491071483
mas "Transmit", id: 1436522307
mas "Wipr", id: 1662217862
