alefragnani.project-manager
angular.ng-template
anthropic.claude-code
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
ecmel.vscode-html-css
editorconfig.editorconfig
edwinhuish.better-comments-next
esbenp.prettier-vscode
firsttris.vscode-jest-runner
fmoronzirfas.open-in-marked
hashicorp.terraform
mkhl.shfmt
ms-playwright.playwright
nrwl.angular-console
sdras.night-owl
supermaven.supermaven
tamasfe.even-better-toml
usernamehw.errorlens
yoavbls.pretty-ts-errors
