alefragnani.project-manager
angular.ng-template
antfu.file-nesting
anthropic.claude-code
be5invis.vscode-custom-css
bradlc.vscode-tailwindcss
charliermarsh.ruff
d-biehl.robotcode
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dnut.rewrap-revived
ecmel.vscode-html-css
editorconfig.editorconfig
edwinhuish.better-comments-next
esbenp.prettier-vscode
expo.vscode-expo-tools
firsttris.vscode-jest-runner
fmoronzirfas.open-in-marked
hashicorp.terraform
idleberg.applescript
mkhl.shfmt
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ndonfris.fish-lsp
nrwl.angular-console
redhat.vscode-xml
redhat.vscode-yaml
sdras.night-owl
tamasfe.even-better-toml
usernamehw.errorlens
vscode-icons-team.vscode-icons
yoavbls.pretty-ts-errors
