aaron-bond.better-comments
adpyke.vscode-sql-formatter
adrianwilczynski.simple-switcher
alefragnani.bookmarks
alefragnani.project-manager
angular.ng-template
antfu.file-nesting
antfu.goto-alias
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
chwoerz.ts-worksheet
cyrilletuzi.angular-schematics
d-biehl.robotcode
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donaldhays.rgbds-z80
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
firsttris.vscode-jest-runner
formulahendry.auto-rename-tag
ghaschel.vscode-angular-html
github.vscode-pull-request-github
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hashicorp.terraform
heybourn.headwind
hookyqr.beautify
idleberg.applescript
jackz.unicode-conversion
jimmyn.jetbrains-dark-new-updated-ui
jock.svg
kevinrose.vsc-python-indent
lextudio.restructuredtext
magicstack.magicpython
mkhl.shfmt
moalamri.inline-fold
mrmlnc.vscode-duplicate
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.live-server
naumovs.color-highlight
neotan.vscode-auto-restart-typescript-eslint-servers
nextfaze.comment-wrap
nrwl.angular-console
omnilib.ufmt
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
sdras.night-owl
stalinbalraj.timestamp-converter
stkb.rewrap
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
sumneko.lua
swyddfa.esbonio
syler.sass-indented
trond-snekvik.simple-rst
tyriar.sort-lines
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
wallabyjs.quokka-vscode
zardoy.disable-ts-errors
zerodind.familiar-java-themes
