aaron-bond.better-comments
alefragnani.project-manager
Angular.ng-template
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
eg2.vscode-npm-script
esbenp.prettier-vscode
fabiospampinato.vscode-search-open-all-results
heybourn.headwind
HookyQR.beautify
jock.svg
keyring.Lua
ms-python.python
ms-python.vscode-pylance
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
sdras.night-owl
stkb.rewrap
stylelint.vscode-stylelint
syler.sass-indented
Tyriar.sort-lines
vscode-icons-team.vscode-icons
zhucy.project-tree
