aaron-bond.better-comments
alefragnani.project-manager
antfu.file-nesting
antfu.goto-alias
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
floone.varnish-vcl
formulahendry.auto-rename-tag
GitHub.vscode-pull-request-github
GraphQL.vscode-graphql
GraphQL.vscode-graphql-syntax
hashicorp.terraform
heybourn.headwind
HookyQR.beautify
iocave.customize-ui
iocave.monkey-patch
jbockle.jbockle-format-files
jock.svg
keyring.Lua
kotfu.bunch
mkhl.shfmt
moalamri.inline-fold
mrmlnc.vscode-duplicate
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
naumovs.color-highlight
nextfaze.comment-wrap
nicollasricas.vscode-witcherscript
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
sdras.night-owl
stkb.rewrap
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
syler.sass-indented
Tyriar.sort-lines
usernamehw.errorlens
vscode-icons-team.vscode-icons
webben.browserslist
zhucy.project-tree
