aaron-bond.better-comments
alefragnani.project-manager
antfu.file-nesting
antfu.goto-alias
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
floone.varnish-vcl
GitHub.vscode-pull-request-github
iocave.customize-ui
iocave.monkey-patch
jock.svg
keyring.Lua
mkhl.shfmt
ms-python.python
ms-python.vscode-pylance
naumovs.color-highlight
nicollasricas.vscode-witcherscript
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
sdras.night-owl
stkb.rewrap
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
syler.sass-indented
Tyriar.sort-lines
usernamehw.errorlens
vscode-icons-team.vscode-icons
zhucy.project-tree
